sim/task_2D_Cylinder_Template/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14620
(
5.84088e-06
5.84256e-06
5.84407e-06
5.84543e-06
5.84665e-06
5.84774e-06
5.84872e-06
5.84959e-06
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 5.84e-06;
    }
    topBot
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
200
(
0.000407819
0.000398113
0.000387873
0.000377101
0.0003658
0.000353976
0.000341653
0.000328838
...
)
;
    }
}


// ************************************************************************* //
