sim/task_2D_Cylinder_Template/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14620
(
1.04473e-09
1.04593e-09
1.04701e-09
1.04798e-09
1.04886e-09
1.04964e-09
1.05034e-09
1.05097e-09
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.0441e-09;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
268
(
1.04418e-09
1.04433e-09
1.04447e-09
1.0446e-09
1.0447e-09
1.04476e-09
1.0448e-09
1.04482e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
1.10012e-09
1.08572e-09
1.08816e-09
1.0929e-09
1.09116e-09
1.09142e-09
1.08924e-09
1.08736e-09
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
200
(
0.000407819
0.000398113
0.000387873
0.000377101
0.0003658
0.000353976
0.000341653
0.000328838
...
)
;
    }
}


// ************************************************************************* //
