sim/task_2D_Cylinder_Template/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "1500";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
28926
(
2.26835
0.00720493
-0.00695752
2.26773
0.0189812
-0.0183591
2.26689
0.0281252
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-2.2686
-2.5068
-2.77002
-3.06087
-3.38226
-3.7374
-4.12982
-4.56346
...
)
;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
268
(
-0.000370113
0.00131264
0.0027996
0.00406297
0.00507408
0.00576541
0.00616298
0.00632058
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
2.32317
2.56476
2.83241
3.12561
3.45035
3.80699
4.2013
4.63495
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
